# Dataframes

DataFrames are the workhorse of Pandas. Similar to R. Even Spark borrows this concept of Dataframes.

We can think of DF as a bunch of Series objects put together.

In [3]:
import pandas as pd
import numpy as np

In [5]:
from numpy.random import randn
np.random.seed(42)

In [40]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [7]:
df

          W         X         Y         Z
A  0.496714 -0.138264  0.647689  1.523030
B -0.234153 -0.234137  1.579213  0.767435
C -0.469474  0.542560 -0.463418 -0.465730
D  0.241962 -1.913280 -1.724918 -0.562288
E -1.012831  0.314247 -0.908024 -1.412304

## Selection and Indexing

In [8]:
df['W']

A    0.496714
B   -0.234153
C   -0.469474
D    0.241962
E   -1.012831
Name: W, dtype: float64

In [9]:
df.W

A    0.496714
B   -0.234153
C   -0.469474
D    0.241962
E   -1.012831
Name: W, dtype: float64

In [11]:
df[['W','Z']]

          W         Z
A  0.496714  1.523030
B -0.234153  0.767435
C -0.469474 -0.465730
D  0.241962 -0.562288
E -1.012831 -1.412304

In [12]:
type(df['W'])

pandas.core.series.Series

### Creating new columns

In [32]:
df['new'] = df['W'] + df['Z']

In [33]:
df

          W         X         Y         Z       new
A  0.496714 -0.138264  0.647689  1.523030  2.019744
B -0.234153 -0.234137  1.579213  0.767435  0.533281
C -0.469474  0.542560 -0.463418 -0.465730 -0.935204
D  0.241962 -1.913280 -1.724918 -0.562288 -0.320325

### Removing columns

In [34]:
df.drop('new',axis=1)

          W         X         Y         Z
A  0.496714 -0.138264  0.647689  1.523030
B -0.234153 -0.234137  1.579213  0.767435
C -0.469474  0.542560 -0.463418 -0.465730
D  0.241962 -1.913280 -1.724918 -0.562288

In [35]:
df

          W         X         Y         Z       new
A  0.496714 -0.138264  0.647689  1.523030  2.019744
B -0.234153 -0.234137  1.579213  0.767435  0.533281
C -0.469474  0.542560 -0.463418 -0.465730 -0.935204
D  0.241962 -1.913280 -1.724918 -0.562288 -0.320325

In [36]:
#df = df.drop('new',axis=1)
df.drop('new',axis=1,inplace=True)

In [37]:
df

          W         X         Y         Z
A  0.496714 -0.138264  0.647689  1.523030
B -0.234153 -0.234137  1.579213  0.767435
C -0.469474  0.542560 -0.463418 -0.465730
D  0.241962 -1.913280 -1.724918 -0.562288

In [26]:
df.drop('E',axis=0,inplace=True)

In [27]:
df

          W         X         Y         Z
A  0.496714 -0.138264  0.647689  1.523030
B -0.234153 -0.234137  1.579213  0.767435
C -0.469474  0.542560 -0.463418 -0.465730
D  0.241962 -1.913280 -1.724918 -0.562288

## Selecting Rows

In [28]:
## Selection based of index label
df.loc['A']

W    0.496714
X   -0.138264
Y    0.647689
Z    1.523030
Name: A, dtype: float64

In [29]:
## Selection based of position
df.iloc[2]

W   -0.469474
X    0.542560
Y   -0.463418
Z   -0.465730
Name: C, dtype: float64

#### Selection of subset of rows and columns

In [31]:
df.loc['B','Y']

1.5792128155073915

In [38]:
df.loc[['A','B'],['W','Z']]

          W         Z
A  0.496714  1.523030
B -0.234153  0.767435

### Conditional Selection

In [41]:
df

          W         X         Y         Z
A  1.465649 -0.225776  0.067528 -1.424748
B -0.544383  0.110923 -1.150994  0.375698
C -0.600639 -0.291694 -0.601707  1.852278
D -0.013497 -1.057711  0.822545 -1.220844
E  0.208864 -1.959670 -1.328186  0.196861

In [42]:
df>0

       W      X      Y      Z
A   True  False   True  False
B  False   True  False   True
C  False  False  False   True
D  False  False   True  False
E   True  False  False   True

In [43]:
df[df>0]

          W         X         Y         Z
A  1.465649       NaN  0.067528       NaN
B       NaN  0.110923       NaN  0.375698
C       NaN       NaN       NaN  1.852278
D       NaN       NaN  0.822545       NaN
E  0.208864       NaN       NaN  0.196861

In [44]:
df[df['W']>0]

          W         X         Y         Z
A  1.465649 -0.225776  0.067528 -1.424748
E  0.208864 -1.959670 -1.328186  0.196861

In [45]:
df[df['W']>0]['Y']

A    0.067528
E   -1.328186
Name: Y, dtype: float64

In [46]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.067528 -0.225776
E -1.328186 -1.959670

In [49]:
## Multiple conditions

df[(df['W']>0) & (df['Y'] > 0)]

          W         X         Y         Z
A  1.465649 -0.225776  0.067528 -1.424748

In [50]:
df

          W         X         Y         Z
A  1.465649 -0.225776  0.067528 -1.424748
B -0.544383  0.110923 -1.150994  0.375698
C -0.600639 -0.291694 -0.601707  1.852278
D -0.013497 -1.057711  0.822545 -1.220844
E  0.208864 -1.959670 -1.328186  0.196861

##### Resetting index

In [51]:
df.reset_index()

  index         W         X         Y         Z
0     A  1.465649 -0.225776  0.067528 -1.424748
1     B -0.544383  0.110923 -1.150994  0.375698
2     C -0.600639 -0.291694 -0.601707  1.852278
3     D -0.013497 -1.057711  0.822545 -1.220844
4     E  0.208864 -1.959670 -1.328186  0.196861

In [52]:
new_index = 'CA NY TX PH SA'.split()

In [53]:
df['States'] = new_index

In [54]:
df

          W         X         Y         Z States
A  1.465649 -0.225776  0.067528 -1.424748     CA
B -0.544383  0.110923 -1.150994  0.375698     NY
C -0.600639 -0.291694 -0.601707  1.852278     TX
D -0.013497 -1.057711  0.822545 -1.220844     PH
E  0.208864 -1.959670 -1.328186  0.196861     SA

In [55]:
df.set_index('States',inplace=True)

In [56]:
df

               W         X         Y         Z
States
CA      1.465649 -0.225776  0.067528 -1.424748
NY     -0.544383  0.110923 -1.150994  0.375698
TX     -0.600639 -0.291694 -0.601707  1.852278
PH     -0.013497 -1.057711  0.822545 -1.220844
SA      0.208864 -1.959670 -1.328186  0.196861

### Multi-Index and Index Hierarchy

In [57]:
## Index Levels

outside = 'G1 G1 G1 G2 G2 G2'.split()
inside = [1,2,3,1,2,3]

hier_index = list(zip(outside,inside))

hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [58]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [59]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [61]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])

In [62]:
df

             A         B
G1 1  0.738467  0.171368
   2 -0.115648 -0.301104
   3 -1.478522 -0.719844
G2 1 -0.460639  1.057122
   2  0.343618 -1.763040
   3  0.324084 -0.385082

In [63]:
df.loc['G1']

          A         B
1  0.738467  0.171368
2 -0.115648 -0.301104
3 -1.478522 -0.719844

In [65]:
df.loc['G1'].loc[1]

A    0.738467
B    0.171368
Name: 1, dtype: float64

In [66]:
df.index.names

FrozenList([None, None])

In [67]:
df.index.names=['Group','Num']

In [68]:
df

                  A         B
Group Num
G1    1    0.738467  0.171368
      2   -0.115648 -0.301104
      3   -1.478522 -0.719844
G2    1   -0.460639  1.057122
      2    0.343618 -1.763040
      3    0.324084 -0.385082

In [69]:
df.xs('G1')

            A         B
Num
1    0.738467  0.171368
2   -0.115648 -0.301104
3   -1.478522 -0.719844

# Great Job !!